# Table of Contents - Lets do this
 <p><div class="lev1"><a href="#Import-pandas,-numpy,-matplotlib-and-seaborn"><span class="toc-item-num">1&nbsp;&nbsp;</span>Import pandas, numpy, matplotlib and seaborn</a></div><div class="lev1"><a href="#Create-a-Series-object,-access-it's-index-and-cells"><span class="toc-item-num">2&nbsp;&nbsp;</span>Create a Series object, access it's index and cells</a></div><div class="lev1"><a href="#Create-a-DataFrame-object,-access-its-rows,-columns,-indices,-cells"><span class="toc-item-num">3&nbsp;&nbsp;</span>Create a DataFrame object, access its rows, columns, indices, cells</a></div><div class="lev1"><a href="#Data-Import"><span class="toc-item-num">4&nbsp;&nbsp;</span>Data Import</a></div><div class="lev1"><a href="#DataFrame-filtering"><span class="toc-item-num">5&nbsp;&nbsp;</span>DataFrame filtering</a></div><div class="lev1"><a href="#Data-export"><span class="toc-item-num">6&nbsp;&nbsp;</span>Data export</a></div><div class="lev1"><a href="#DataFrame-aggregation"><span class="toc-item-num">7&nbsp;&nbsp;</span>DataFrame aggregation</a></div><div class="lev1"><a href="#Data-Merging"><span class="toc-item-num">8&nbsp;&nbsp;</span>Data Merging</a></div>

This notebook is to quickly repeat the most basic pandas operations prior to starting the practical course.
You should be able to quickly perform the following tasks before you start working on the exercises in the Day1 notebook. If you need to look up, how certain problems can be solved, have a look at the pandas [10 Minutes Introduction](http://pandas.pydata.org/pandas-docs/stable/10min.html), the [tutorials](http://pandas.pydata.org/pandas-docs/stable/tutorials.html) and the lecture slides.

# Import pandas, numpy, matplotlib and seaborn

In [4]:
import pandas as pd
import numpy as np
import matplotlib
import matplotlib.pyplot as plt
import seaborn as sns

/share/opt/x86_64_sl7/anaconda2/lib/python2.7/site-packages/numexpr/cpuinfo.py:42: UserWarning: [Errno 2] No such file or directory
  warnings.warn(str(e), UserWarning, stacklevel=stacklevel)
/share/opt/x86_64_sl7/anaconda2/lib/python2.7/site-packages/matplotlib/font_manager.py:273: UserWarning: Matplotlib is building the font cache using fc-list. This may take a moment.
  warnings.warn('Matplotlib is building the font cache using fc-list. This may take a moment.')

# Create a Series object, access it's index and cells

Create a Series object representing the following measurements

| S   |
|-----|
| 1.0 |
| 1.5 |
| 3.0 |
| 4.3 |
| 8.2 |

In [14]:
s = pd.Series([1.0, 1.5, 3.0, 4.3, 8.2], index=['A', 'B', 'C', 'D', 'E'])

In [17]:
s

A    1.0
B    1.5
C    3.0
D    4.3
E    8.2
dtype: float64

In [15]:
s.values

array([ 1. ,  1.5,  3. ,  4.3,  8.2])

In [16]:
s.index

Index([u'A', u'B', u'C', u'D', u'E'], dtype='object')

# Create a DataFrame object, access its rows, columns, indices, cells

Create a dataframe of the following table.

|index   |a |b  |c   |d          |e |
|--------|--|---|----|-----------|--|
|1       |2 |3  |5.  |horse      |13|
|2       |3 |1  |1.4 |cat        |11|
|3       |4 |9  |1.2 |dog        |  |
|4       |5 |12 |0.8 |tortoise   |  |
|5       |6 |2  |2.3 |rabbit     |9 |

Now
* access the values of each row individually
* access single cells
* print the index and column names
* access values of each column individually
* rename columns
* extract rows 2-4 as new dataframe
* obtain summary table of dataframe

In [102]:
#create new DataFrame with corresponding entries
df = pd.DataFrame([[2,3,5.0,'horse',13], [3,1,1.4,'cat',11], [4,9,1.2,'dog',np.nan], [5, 12, 0.8, 'tortoise', np.nan], [6, 2, 2.3, 'rabbit', 9]], index=list('12345'),columns=list('abcde'))

In [103]:
#access values of each row
df.iloc[1]

a      3
b      1
c    1.4
d    cat
e     11
Name: 2, dtype: object

In [104]:
df.iloc[2]

a      4
b      9
c    1.2
d    dog
e    NaN
Name: 3, dtype: object

In [105]:
#access single cells
df.iloc[3,3]

'tortoise'

In [108]:
#print index and column names
print df.index

Index([u'1', u'2', u'3', u'4', u'5'], dtype='object')

In [109]:
print df.columns

Index([u'a', u'b', u'c', u'd', u'e'], dtype='object')

In [110]:
#access columns
a = df['d']
a

1       horse
2         cat
3         dog
4    tortoise
5      rabbit
Name: d, dtype: object

In [111]:
#rename columns
df.rename(columns={"c" : "blaa"})

   a   b  blaa         d     e
1  2   3   5.0     horse  13.0
2  3   1   1.4       cat  11.0
3  4   9   1.2       dog   NaN
4  5  12   0.8  tortoise   NaN
5  6   2   2.3    rabbit   9.0

In [113]:
#extract rows 2-4 into new DataFrame
df2 = df[1:4]
df2

   a   b    c         d     e
2  3   1  1.4       cat  11.0
3  4   9  1.2       dog   NaN
4  5  12  0.8  tortoise   NaN

In [117]:
#get table summary
df.describe()

              a          b         c     e
count  5.000000   5.000000  5.000000   3.0
mean   4.000000   5.400000  2.140000  11.0
std    1.581139   4.827007  1.690562   2.0
min    2.000000   1.000000  0.800000   9.0
25%    3.000000   2.000000  1.200000   NaN
50%    4.000000   3.000000  1.400000   NaN
75%    5.000000   9.000000  2.300000   NaN
max    6.000000  12.000000  5.000000  13.0

In [116]:
df.mean()

a     4.00
b     5.40
c     2.14
e    11.00
dtype: float64

# Data Import

Import the following file into a dataframe _df2_:

https://raw.githubusercontent.com/cschaerfe/PIBI/master/example_data/example_df.csv?token=AC7j1EQvTFcnGxOxN0s7SKGaZbaw-AEhks5X4VAvwA%3D%3D

In [151]:
# import into dataframe df2
df2 = pd.read_csv("https://raw.githubusercontent.com/cschaerfe/PIBI/master/example_data/example_df.csv?token=AC7j1EQvTFcnGxOxN0s7SKGaZbaw-AEhks5X4VAvwA%3D%3D"
                 )
df2

   a   b    c         d     e
0  2   3  5.0     horse  13.0
1  3   1  1.4       cat  11.0
2  4   9  1.2       dog   NaN
3  5  12  0.8  tortoise   NaN
4  6   2  2.3    rabbit   9.0

Now import the following file into a pandas dataframe _df3_. Do you need to change some parameters of the funtion?
Check whether import makes sense by showing the dataframe

https://raw.githubusercontent.com/cschaerfe/PIBI/master/example_data/example_df2.csv?token=AC7j1IqAY5PTE1Iadona7kkl6e6Fs4Krks5X4VOIwA%3D%3D

In [419]:
# import the given table. Since the sperator here is ";", the seperator parameter needs to be set.
df3 = pd.read_csv("https://raw.githubusercontent.com/cschaerfe/PIBI/master/example_data/example_df2.csv?token=AC7j1IqAY5PTE1Iadona7kkl6e6Fs4Krks5X4VOIwA%3D%3D", sep=";")

In [420]:
df3

   a   b    c         d     e
0  2   3  5.0     horse  13.0
1  3   1  1.4       cat  11.0
2  4   9  1.2       dog   NaN
3  5  12  0.8  tortoise   NaN
4  6   2  2.3    rabbit   9.0

# DataFrame filtering
Using the dataframe created in section 3:

* select rows containing values greater than 2 in the 3rd column
* select rows that contain values greater than 2 in the 3rd column or 'cat' in the 4th column
* drop rows with missing data
* drop duplicate rows
* drop 1st column from dataframe
* sort rows by 2nd column
* convert Strings in 4th column to title-case

In [421]:
#select rows with values greater than 2
df3[df3.ix[:,2] > 2]

   a  b    c       d     e
0  2  3  5.0   horse  13.0
4  6  2  2.3  rabbit   9.0

In [422]:
#select rows that either have value > 2 or have "cat" in the 4th column
df3[(df3.ix[:,2] > 2) | (df3.ix[:,3] == "cat")]

   a  b    c       d     e
0  2  3  5.0   horse  13.0
1  3  1  1.4     cat  11.0
4  6  2  2.3  rabbit   9.0

In [423]:
#drop NaNs out of the table
df3.dropna(how="any", inplace=True)
df3

   a  b    c       d     e
0  2  3  5.0   horse  13.0
1  3  1  1.4     cat  11.0
4  6  2  2.3  rabbit   9.0

In [424]:
#drop duplicates
df3.drop_duplicates(inplace= True)
df3

   a  b    c       d     e
0  2  3  5.0   horse  13.0
1  3  1  1.4     cat  11.0
4  6  2  2.3  rabbit   9.0

In [425]:
#drop the first column
df3.drop("a", axis=1, inplace=True)

In [426]:
#sort values with descending order
df3.sort_values(['b'], inplace=True)

In [427]:
#All strings get title-cased
df3.d = df3['d'].str.title()

In [428]:
df3

   b    c       d     e
1  1  1.4     Cat  11.0
4  2  2.3  Rabbit   9.0
0  3  5.0   Horse  13.0

# Data export

Export your filtered dataframe as a text file separated by tabs omitting the index column.

In [429]:
# export the dataframe to a textfile called "df3.txt"
df3.to_csv("df3.txt", sep="\t")

# DataFrame aggregation

Using _df4_, group the data by column 'b'. Test different ways of aggregating the remaining columns as shown in the lecture.

In [430]:
df4 = pd.read_csv("https://raw.githubusercontent.com/cschaerfe/Integrated_Bioinformatics/master/example_data/df4.csv")

In [431]:
# group the data by different parameters
s = df4.groupby('b')

In [432]:
#aggregate among the mean
s.agg(np.mean)

                c     e
b
fish     0.900000  10.0
mammal   2.533333  12.0
reptile  2.300000   9.0

In [433]:
#aggregate among max
s.agg(np.max)

           c      d     e
b
fish     1.8    koi  10.0
mammal   5.0  horse  13.0
reptile  2.3  snake   9.0

In [434]:
#double aggregate with min and mean
s.agg({'c': {'min': np.min, 'mean': np.mean}})

                c
             mean  min
b
fish     0.900000  0.1
mammal   2.533333  1.2
reptile  2.300000  2.3

# Data Merging

* Merge df3 with df4 on columns c, d and e. Change columns with same names in a meaningful way.

In [456]:
df3

   b    c       d     e
1  1  1.4     Cat  11.0
4  2  2.3  Rabbit   9.0
0  3  5.0   Horse  13.0

In [457]:
#change strings in df4 to title Case
df4.d = df4['d'].str.title()

In [458]:
df4

         b    c         d     e
0   mammal  5.0     Horse  13.0
1   mammal  1.4       Cat  11.0
2   mammal  1.2       Dog   NaN
3     fish  0.1  Goldfish   NaN
4  reptile  2.3     Snake   9.0
5     fish  1.8       Koi  10.0
6     fish  0.8      Carp   NaN

In [462]:
#merge df3 and df4 among columns c,d,e. 
merged = pd.merge(df3, df4, on=['c','d','e'], suffixes=('_df3', '_df4'))
merged

   b_df3    c      d     e   b_df4
0      1  1.4    Cat  11.0  mammal
1      3  5.0  Horse  13.0  mammal

* Now perform a full outer join of the data, to keep all rows contained in either of the two dataframes.